Extanded-flat-plate/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       1540;
    }
    zeroGradientPlanes
    {
        type            wall;
        inGroups        1(wall);
        nFaces          80;
        startFace       1560;
    }
    leftWall
    {
        type            patch;
        nFaces          20;
        startFace       1640;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          1600;
        startFace       1660;
    }
)

// ************************************************************************* //
